tiborsimon/embedded-tdd-headers/pic/8bit/pic18f67k90_tdd.h
#define CCH13                         522
#define CM3CON_CCH1                   523
#define CM3CON_CREF                   524
#define CREF3                         525
#define CM3CON_EVPOL                  526
#define EVPOL03                       527
#define CM3CON_EVPOL0                 528
#define CM3CON_EVPOL1                 529
#define EVPOL13                       530
#define CM3CON_CPOL                   531
#define CPOL3                         532
#define COE3                          533
#define CM3CON_COE                    534
#define CM3CON_CON                    535
#define CON3                          536
#define CM2CON                        537
#define CM2CON_CCH                    538
#define CM2CON_CCH0                   539
#define CCH02                         540
#define CCH12                         541
#define CM2CON_CCH1                   542
#define CM2CON_CREF                   543
#define CREF2                         544
#define CM2CON_EVPOL                  545
#define EVPOL02                       546
#define CM2CON_EVPOL0                 547
#define EVPOL12                       548
#define CM2CON_EVPOL1                 549
#define CM2CON_CPOL                   550
#define CPOL2                         551
#define CM2CON_COE                    552
#define COE2                          553
#define CM2CON_CON                    554
#define CON2                          555
#define T12CON                        556
#define T12CKPS0                      557
#define T12CKPS                       558
#define T12CKPS1                      559
#define TMR12ON                       560
#define T12OUTPS0                     561
#define T12OUTPS                      562
#define T12OUTPS1                     563
#define T12OUTPS2                     564
#define T12OUTPS3                     565
#define PR12                          566
#define TMR12                         567
#define T10CON                        568
#define T10CKPS                       569
#define T10CKPS0                      570
#define T10CKPS1                      571
#define TMR10ON                       572
#define T10OUTPS0                     573
#define T10OUTPS                      574
#define T10OUTPS1                     575
#define T10OUTPS2                     576
#define T10OUTPS3                     577
#define PR10                          578
#define TMR10                         579
#define T8CON                         580
#define T8CKPS0                       581
#define T8CKPS                        582
#define T8CKPS1                       583
#define TMR8ON                        584
#define T8OUTPS                       585
#define T8OUTPS0                      586
#define T8OUTPS1                      587
#define T8OUTPS2                      588
#define T8OUTPS3                      589
#define PR8                           590
#define TMR8                          591
#define T6CON                         592
#define T6CKPS0                       593
#define T6CKPS                        594
#define T6CKPS1                       595
#define TMR6ON                        596
#define T6OUTPS0                      597
#define T6OUTPS                       598
#define T6OUTPS1                      599
#define T6OUTPS2                      600
#define T6OUTPS3                      601
#define PR6                           602
#define TMR6                          603
#define T7GCON                        604
#define T7GSS0                        605
#define T7GSS                         606
#define T7GSS1                        607
#define T7GVAL                        608
#define nT7DONE                       609
#define T7GGO_NOT_T7DONE              610
#define NOT_T7DONE                    611
#define T7GGO_nT7DONE                 612
#define T7GGO                         613
#define T7GSPM                        614
#define T7GTM                         615
#define T7GPOL                        616
#define TMR7GE                        617
#define T7CON                         618
#define TMR7ON                        619
#define T7CON_RD16                    620
#define RD167                         621
#define nT7SYNC                       622
#define NOT_T7SYNC                    623
#define SOSCEN7                       624
#define T7CON_SOSCEN                  625
#define T7CKPS                        626
#define T7CKPS0                       627
#define T7CKPS1                       628
#define TMR7CS                        629
#define TMR7CS0                       630
#define TMR7CS1                       631
#define TMR7L                         632
#define CAL07                         633
#define CAL17                         634
#define CAL27                         635
#define CAL37                         636
#define CAL47                         637
#define CAL57                         638
#define CAL67                         639
#define CAL77                         640
#define TMR7H                         641
#define CCP10CON                      642
#define CCP10M                        643
#define CCP10M0                       644
#define CCP10M1                       645
#define CCP10M2                       646
#define CCP10M3                       647
#define CCP10Y                        648
#define DC10B0                        649
#define DC10B                         650
#define CCP10X                        651
#define DC10B1                        652
#define CCPR10L                       653
#define CCPR10H                       654
#define CCP9CON                       655
#define CCP9M0                        656
#define CCP9M                         657
#define CCP9M1                        658
#define CCP9M2                        659
#define CCP9M3                        660
#define CCP9Y                         661
#define DC9B0                         662
#define DC9B                          663
#define CCP9X                         664
#define DC9B1                         665
#define CCPR9L                        666
#define CCPR9H                        667
#define CCP8CON                       668
#define CCP8M0                        669
#define CCP8M                         670
#define CCP8M1                        671
#define CCP8M2                        672
#define CCP8M3                        673
#define DC8B0                         674
#define CCP8Y                         675
#define DC8B                          676
#define DC8B1                         677
#define CCP8X                         678
#define CCPR8L                        679
#define CCPR8H                        680
#define CCP3CON                       681
#define CCP3M                         682
#define CCP3M0                        683
#define CCP3M1                        684
#define CCP3M2                        685
#define CCP3M3                        686
#define CCP3Y                         687
#define DC3B                          688
#define DC3B0                         689
#define DC3B1                         690
#define CCP3X                         691
#define P3M                           692
#define P3M0                          693
#define P3M1                          694
#define CCPR3L                        695
#define CCPR3H                        696
#define ECCP3DEL                      697
#define P3DC                          698
#define P3DC0                         699
#define P3DC1                         700
#define P3DC2                         701
#define P3DC3                         702
#define P3DC4                         703
#define P3DC5                         704
#define P3DC6                         705
#define P3RSEN                        706
#define PSS3BD0                       707
#define PSS3BD                        708
#define PSS3BD1                       709
#define PSS3AC0                       710
#define PSS3AC                        711
#define PSS3AC1                       712
#define ECCP3AS                       713
#define ECCP3AS0                      714
#define ECCP3AS1                      715
#define ECCP3AS2                      716
#define ECCP3ASE                      717
#define CCP2CON                       718
#define CCP2M                         719
#define CCP2M0                        720
#define CCP2M1                        721
#define CCP2M2                        722
#define CCP2M3                        723
#define DC2B                          724
#define DC2B0                         725
#define CCP2Y                         726
#define DC2B1                         727
#define CCP2X                         728
#define P2M                           729
#define P2M0                          730
#define P2M1                          731
#define CCPR2L                        732
#define CCPR2H                        733
#define ECCP2DEL                      734
#define P2DC                          735
#define P2DC0                         736
#define P2DC1                         737
#define P2DC2                         738
#define P2DC3                         739
#define P2DC4                         740
#define P2DC5                         741
#define P2DC6                         742
#define P2RSEN                        743
#define PSS2BD                        744
#define PSS2BD0                       745
#define PSS2BD1                       746
#define PSS2AC0                       747
#define PSS2AC                        748
#define PSS2AC1                       749
#define ECCP2AS0                      750
#define ECCP2AS                       751
#define ECCP2AS1                      752
#define ECCP2AS2                      753
#define ECCP2ASE                      754
#define PADCFG1                       755
#define RTSECSEL0                     756
#define RTSECSEL                      757
#define RTSECSEL1                     758
#define REPU                          759
#define RDPU                          760
#define CM1CON                        761
#define CM1CON_CCH                    762
#define C1CH0                         763
#define CM1CON_CCH0                   764
#define CCH01                         765
#define CCH11                         766
#define C1CH1                         767
#define CM1CON_CCH1                   768
#define CM1CON_CREF                   769
#define CREF1                         770
#define EVPOL01                       771
#define CM1CON_EVPOL0                 772
#define CM1CON_EVPOL                  773
#define CM1CON_EVPOL1                 774
#define EVPOL11                       775
#define CM1CON_CPOL                   776
#define CPOL1                         777
#define CM1CON_COE                    778
#define COE1                          779
#define CM1CON_CON                    780
#define CON1                          781
#define CTMUICON                      782
#define IRNG                          783
#define IRNG0                         784
#define IRNG1                         785
#define ITRIM0                        786
#define ITRIM                         787
#define ITRIM1                        788
#define ITRIM2                        789
#define ITRIM3                        790
#define ITRIM4                        791
#define ITRIM5                        792
#define CTMUCONL                      793
#define EDG1STAT                      794
#define EDG2STAT                      795
#define EDG1SEL                       796
#define EDG1SEL0                      797
#define EDG1SEL1                      798
#define EDG1POL                       799
#define EDG2SEL0                      800
#define EDG2SEL                       801
#define EDG2SEL1                      802
#define EDG2POL                       803
#define CTMUCONH                      804
#define CTTRIG                        805
#define IDISSEN                       806
#define EDGSEQEN                      807
#define EDGEN                         808
#define TGEN                          809
#define CTMUSIDL                      810
#define CTMUEN                        811
#define ALRMVALL                      812
#define ALRMVALH                      813
#define ALRMRPT                       814
#define ARPT0                         815
#define ARPT                          816
#define ARPT1                         817
#define ARPT2                         818
#define ARPT3                         819
#define ARPT4                         820
#define ARPT5                         821
#define ARPT6                         822
#define ARPT7                         823
#define ALRMCFG                       824
#define ALRMPTR                       825
#define ALRMPTR0                      826
#define ALRMPTR1                      827
#define AMASK0                        828
#define AMASK                         829
#define AMASK1                        830
#define AMASK2                        831
#define AMASK3                        832
#define CHIME                         833
#define ALRMEN                        834
#define RTCVALL                       835
#define WAITE0                        836
#define RTCVALH                       837
#define WAITE1                        838
#define WAITM0                        839
#define WAITM1                        840
#define WAITM2                        841
#define WAITM3                        842
#define WAITB0                        843
#define WAITB1                        844
#define RTCCAL                        845
#define CAL0                          846
#define CAL                           847
#define CAL1                          848
#define CAL2                          849
#define CAL3                          850
#define CAL4                          851
#define CAL5                          852
#define CAL6                          853
#define CAL7                          854
#define RTCCFG                        855
#define RTCPTR0                       856
#define RTCPTR                        857
#define RTCPTR1                       858
#define RTCOE                         859
#define HALFSEC                       860
#define RTCSYNC                       861
#define RTCWREN                       862
#define RTCEN                         863
#define PIE6                          864
#define CMP1IE                        865
#define CMP2IE                        866
#define CMP3IE                        867
#define EEIE                          868
#define EEDATA                        869
#define EEADR                         870
#define EEADRH                        871
#define OSCCON2                       872
#define MFIOSEL                       873
#define MFIOFS                        874
#define SOSCGO                        875
#define SOSCRUN                       876
#define BAUDCON1                      877
#define BAUDCON1_ABDEN                878
#define ABDEN1                        879
#define BAUDCON1_WUE                  880
#define WUE1                          881
#define W4E                           882
#define BRG161                        883
#define BAUDCON1_BRG16                884
#define CKTXP                         885
#define BAUDCON1_TXCKP                886
#define SCKP1                         887
#define TXCKP1                        888
#define SCKP                          889
#define DTRXP1                        890
#define RXDTP1                        891
#define DTRXP                         892
#define RXCKP                         893
#define BAUDCON1_RXDTP                894
#define RCMT1                         895
#define RCIDL1                        896
#define BAUDCON1_RCIDL                897
#define RCMT                          898
#define ABDOVF1                       899
#define BAUDCON1_ABDOVF               900
#define LCDDATA0                      901
#define S00C0                         902
#define S01C0                         903
#define S02C0                         904
#define S03C0                         905
#define S04C0                         906
#define S05C0                         907
#define S06C0                         908
#define S07C0                         909
#define LCDDATA1                      910
#define S08C0                         911
#define S09C0                         912
#define S10C0                         913
#define S11C0                         914
#define S12C0                         915
#define S13C0                         916
#define S14C0                         917
#define S15C0                         918
#define LCDDATA2                      919
#define S16C0                         920
#define S17C0                         921
#define S18C0                         922
#define S19C0                         923
#define S20C0                         924
#define S21C0                         925
#define S22C0                         926
#define S23C0                         927
#define LCDDATA3                      928
#define S24C0                         929
#define S25C0                         930
#define S26C0                         931
#define S27C0                         932
#define S28C0                         933
#define S29C0                         934
#define S30C0                         935
#define S31C0                         936
#define LCDDATA4                      937
#define S32C0                         938
#define LCDDATA6                      939
#define S00C1                         940
#define S01C1                         941
#define S02C1                         942
#define S03C1                         943
#define S04C1                         944
#define S05C1                         945
#define S06C1                         946
#define S07C1                         947
#define LCDDATA7                      948
#define S08C1                         949
#define S09C1                         950
#define S10C1                         951
#define S11C1                         952
#define S12C1                         953
#define S13C1                         954
#define S14C1                         955
#define S15C1                         956
#define LCDDATA8                      957
#define S16C1                         958
#define S17C1                         959
#define S18C1                         960
#define S19C1                         961
#define S20C1                         962
#define S21C1                         963
#define S22C1                         964
#define S23C1                         965
#define LCDDATA9                      966
#define S24C1                         967
#define S25C1                         968
#define S26C1                         969
#define S27C1                         970
#define S28C1                         971
#define S29C1                         972
#define S30C1                         973
#define S31C1                         974
#define LCDDATA10                     975
#define S32C1                         976
#define LCDDATA12                     977
#define SSPM012                       978
#define S00C2                         979
#define S01C2                         980
#define SSPM112                       981
#define SSPM212                       982
#define S02C2                         983
#define S03C2                         984
#define SSPM312                       985
#define S04C2                         986
#define S05C2                         987
#define S06C2                         988
#define S07C2                         989
#define LCDDATA13                     990
#define S08C2                         991
#define S09C2                         992
#define S10C2                         993
#define S11C2                         994
#define S12C2                         995
#define S13C2                         996
#define S14C2                         997
#define S15C2                         998
#define LCDDATA14                     999
#define LCDDATA14_MSK0                1000
#define S16C2                         1001
#define LCDDATA14_MSK1                1002
#define S17C2                         1003
#define LCDDATA14_MSK2                1004
#define S18C2                         1005
#define S19C2                         1006
#define LCDDATA14_MSK3                1007
#define LCDDATA14_MSK4                1008
#define S20C2                         1009
#define LCDDATA14_MSK5                1010
#define S21C2                         1011
#define LCDDATA14_MSK6                1012
#define S22C2                         1013
#define LCDDATA14_MSK7                1014
#define S23C2                         1015
#define LCDDATA15                     1016
#define S24C2                         1017
#define S25C2                         1018
#define S26C2                         1019
#define S27C2                         1020
#define S28C2                         1021
#define S29C2                         1022
#define S30C2                         1023
#define S31C2                         1024
#define LCDDATA16                     1025
#define S32C2                         1026
#define T4CKPS016                     1027
#define LCDDATA18                     1028
#define S00C3                         1029
#define S01C3                         1030
#define S02C3                         1031
#define S03C3                         1032
#define S04C3                         1033
#define S05C3                         1034
#define S06C3                         1035
#define S07C3                         1036
#define LCDDATA19                     1037
#define S08C3                         1038
#define S09C3                         1039
#define S10C3                         1040
#define S11C3                         1041
#define S12C3                         1042
#define T3CKPS019                     1043
#define T3CKPS119                     1044
#define S13C3                         1045
#define S14C3                         1046
#define TMR3CS019                     1047
#define TMR3CS119                     1048
#define S15C3                         1049
#define LCDDATA20                     1050
#define S16C3                         1051
#define S17C3                         1052
#define S18C3                         1053
#define S19C3                         1054
#define S20C3                         1055
#define S21C3                         1056
#define S22C3                         1057
#define S23C3                         1058
#define LCDDATA21                     1059
#define S24C3                         1060
#define S25C3                         1061
#define S26C3                         1062
#define S27C3                         1063
#define S28C3                         1064
#define S29C3                         1065
#define S30C3                         1066
#define S31C3                         1067
#define LCDDATA22                     1068
#define S32C3                         1069
#define EECON2                        1070
#define EECON1                        1071
#define EECON1_RD                     1072
#define EECON1_WR                     1073
#define WREN                          1074
#define WRERR                         1075
#define FREE                          1076
#define CFGS                          1077
#define EEFS                          1078
#define EEPGD                         1079
#define PORTA                         1080
#define ULPWUIN                       1081
#define AN0                           1082
#define RA0                           1083
#define SEG18                         1084
#define AN1                           1085
#define RA1                           1086
#define AN2                           1087
#define RA2                           1088
#define VREF_MINUS                    1089
#define AN3                           1090
