tiborsimon/embedded-tdd-headers/pic/8bit/pic18f67k90_tdd.h
#define VREF_PLUS                     1091
#define RA3                           1092
#define SEG14                         1093
#define T0CKI                         1094
#define RA4                           1095
#define SEG15                         1096
#define AN4                           1097
#define T1CKI                         1098
#define LVDIN                         1099
#define RA5                           1100
#define T3G                           1101
#define CLKO                          1102
#define RA6                           1103
#define OSC2                          1104
#define CLKI                          1105
#define PORTA_RJPU                    1106
#define RA7                           1107
#define OSC1                          1108
#define PORTB                         1109
#define SEG30                         1110
#define FLT0                          1111
#define RB0                           1112
#define INT0                          1113
#define RB1                           1114
#define INT1                          1115
#define SEG8                          1116
#define RB2                           1117
#define INT2                          1118
#define CTED1                         1119
#define SEG9                          1120
#define SEG10                         1121
#define RB3                           1122
#define INT3                          1123
#define CCP2_PA2                      1124
#define CTED2                         1125
#define SEG11                         1126
#define RB4                           1127
#define KBI0                          1128
#define PGM                           1129
#define T3CKI                         1130
#define RB5                           1131
#define SEG29                         1132
#define KBI1                          1133
#define T1G                           1134
#define PGC                           1135
#define RB6                           1136
#define KBI2                          1137
#define PGD                           1138
#define RB7                           1139
#define KBI3                          1140
#define PORTC                         1141
#define SCKLI                         1142
#define RC0                           1143
#define SOSCO                         1144
#define SEG32                         1145
#define PORTC_PA2                     1146
#define PORTC_CCP2                    1147
#define RC1                           1148
#define SOSCI                         1149
#define SEG13                         1150
#define CCP1                          1151
#define PA1                           1152
#define RC2                           1153
#define SEG17                         1154
#define SCK1                          1155
#define SCL1                          1156
#define RC3                           1157
#define SEG16                         1158
#define SDI1                          1159
#define SDA1                          1160
#define RC4                           1161
#define SEG12                         1162
#define SDO1                          1163
#define RC5                           1164
#define SEG27                         1165
#define TX1                           1166
#define RC6                           1167
#define CK1                           1168
#define DT1                           1169
#define RX1                           1170
#define SEG28                         1171
#define RC7                           1172
#define PORTD                         1173
#define PSP0                          1174
#define RD0                           1175
#define CTPLS                         1176
#define AD0                           1177
#define SEG0                          1178
#define PSP1                          1179
#define RD1                           1180
#define T5CKI                         1181
#define T7G                           1182
#define AD1                           1183
#define SEG1                          1184
#define PSP2                          1185
#define RD2                           1186
#define AD2                           1187
#define SEG2                          1188
#define PSP3                          1189
#define RD3                           1190
#define AD3                           1191
#define SEG3                          1192
#define PSP4                          1193
#define RD4                           1194
#define AD4                           1195
#define SDO2                          1196
#define SEG4                          1197
#define PSP5                          1198
#define RD5                           1199
#define SDI2                          1200
#define AD5                           1201
#define SDA2                          1202
#define SEG5                          1203
#define SEG6                          1204
#define SCK2                          1205
#define PSP6                          1206
#define RD6                           1207
#define AD6                           1208
#define SCL2                          1209
#define SS2                           1210
#define PSP7                          1211
#define RD7                           1212
#define AD7                           1213
#define SEG7                          1214
#define PORTE                         1215
#define PD2                           1216
#define AD8                           1217
#define PORTE_RD                      1218
#define RDE                           1219
#define LCDBIAS1                      1220
#define RE0                           1221
#define AD9                           1222
#define PORTE_WR                      1223
#define WRE                           1224
#define LCDBIAS2                      1225
#define RE1                           1226
#define PC2                           1227
#define PORTE_CS                      1228
#define PB2                           1229
#define CCP10                         1230
#define AD10                          1231
#define LCDBIAS3                      1232
#define RE2                           1233
#define CCP9                          1234
#define COM0                          1235
#define CCP9E                         1236
#define AD11                          1237
#define RE3                           1238
#define PC3                           1239
#define PC3E                          1240
#define CCP8                          1241
#define PB3E                          1242
#define PB3                           1243
#define COM1                          1244
#define REFO                          1245
#define AD12                          1246
#define RE4                           1247
#define CCP8E                         1248
#define PC1                           1249
#define CCP7                          1250
#define COM2                          1251
#define CCP7E                         1252
#define AD13                          1253
#define RE5                           1254
#define PC1E                          1255
#define CCP6E                         1256
#define CCP6                          1257
#define PB1                           1258
#define COM3                          1259
#define AD14                          1260
#define RE6                           1261
#define PB1E                          1262
#define PORTE_CCP2                    1263
#define CCP2E                         1264
#define SEG31                         1265
#define PA2E                          1266
#define PORTE_PA2                     1267
#define AD15                          1268
#define RE7                           1269
#define PORTF                         1270
#define SEG19                         1271
#define C2OUTF                        1272
#define AN6                           1273
#define PORTF_C2OUT                   1274
#define RF1                           1275
#define CTDIN                         1276
#define PORTF_C1OUT                   1277
#define AN7                           1278
#define RF2                           1279
#define C1OUTF                        1280
#define SEG20                         1281
#define AN8                           1282
#define RF3                           1283
#define SEG21                         1284
#define CTMUI                         1285
#define C2INB                         1286
#define AN9                           1287
#define RF4                           1288
#define SEG22                         1289
#define C2INA                         1290
#define C1INB                         1291
#define RF5                           1292
#define SEG23                         1293
#define CVREF                         1294
#define AN10                          1295
#define C1INA                         1296
#define RF6                           1297
#define SEG24                         1298
#define AN11                          1299
#define SS1                           1300
#define AN5                           1301
#define RF7                           1302
#define SEG25                         1303
#define PORTG                         1304
#define CCP3                          1305
#define PA3                           1306
#define RG0                           1307
#define C3OUTG                        1308
#define PORTG_C3OUT                   1309
#define TX2                           1310
#define RG1                           1311
#define CK2                           1312
#define AN19                          1313
#define C3INA                         1314
#define RX2                           1315
#define RG2                           1316
#define DT2                           1317
#define AN18                          1318
#define CCP4                          1319
#define PD3                           1320
#define C3INB                         1321
#define RG3                           1322
#define AN17                          1323
#define CCP5                          1324
#define PD1                           1325
#define SEG26                         1326
#define C3INC                         1327
#define T7CKI                         1328
#define T5G                           1329
#define RG4                           1330
#define RTCC                          1331
#define AN16                          1332
#define PORTG_RJPU                    1333
#define RG5                           1334
#define LATA                          1335
#define LATA0                         1336
#define LA0                           1337
#define LATA1                         1338
#define LA1                           1339
#define LATA2                         1340
#define LA2                           1341
#define LATA3                         1342
#define LA3                           1343
#define LATA4                         1344
#define LA4                           1345
#define LATA5                         1346
#define LA5                           1347
#define LATA6                         1348
#define LA6                           1349
#define LATA7                         1350
#define LA7                           1351
#define LATB                          1352
#define LB0                           1353
#define LATB0                         1354
#define LB1                           1355
#define LATB1                         1356
#define LB2                           1357
#define LATB2                         1358
#define LB3                           1359
#define LATB3                         1360
#define LB4                           1361
#define LATB4                         1362
#define LB5                           1363
#define LATB5                         1364
#define LB6                           1365
#define LATB6                         1366
#define LB7                           1367
#define LATB7                         1368
#define LATC                          1369
#define LATC0                         1370
#define LC0                           1371
#define LATC1                         1372
#define LC1                           1373
#define LATC2                         1374
#define LC2                           1375
#define LATC3                         1376
#define LC3                           1377
#define LATC4                         1378
#define LC4                           1379
#define LATC5                         1380
#define LC5                           1381
#define LATC6                         1382
#define LC6                           1383
#define LATC7                         1384
#define LC7                           1385
#define LATD                          1386
#define LATD0                         1387
#define LD0                           1388
#define LATD1                         1389
#define LD1                           1390
#define LATD2                         1391
#define LD2                           1392
#define LATD3                         1393
#define LD3                           1394
#define LATD4                         1395
#define LD4                           1396
#define LATD5                         1397
#define LD5                           1398
#define LATD6                         1399
#define LD6                           1400
#define LATD7                         1401
#define LD7                           1402
#define LATE                          1403
#define LATE0                         1404
#define LE0                           1405
#define LATE1                         1406
#define LE1                           1407
#define LATE2                         1408
#define LE2                           1409
#define LATE3                         1410
#define LE3                           1411
#define LATE4                         1412
#define LE4                           1413
#define LATE5                         1414
#define LE5                           1415
#define LATE6                         1416
#define LE6                           1417
#define LATE7                         1418
#define LE7                           1419
#define LATF                          1420
#define LATF1                         1421
#define LF1                           1422
#define LF2                           1423
#define LATF2                         1424
#define LF3                           1425
#define LATF3                         1426
#define LF4                           1427
#define LATF4                         1428
#define LF5                           1429
#define LATF5                         1430
#define LF6                           1431
#define LATF6                         1432
#define LF7                           1433
#define LATF7                         1434
#define LATG                          1435
#define LATG0                         1436
#define LG0                           1437
#define LATG1                         1438
#define LG1                           1439
#define LATG2                         1440
#define LG2                           1441
#define LATG3                         1442
#define LG3                           1443
#define LATG4                         1444
#define LG4                           1445
#define TRISA                         1446
#define TRISA0                        1447
#define TRISA1                        1448
#define TRISA2                        1449
#define TRISA3                        1450
#define TRISA4                        1451
#define TRISA5                        1452
#define TRISA6                        1453
#define TRISA7                        1454
#define TRISB                         1455
#define TRISB0                        1456
#define TRISB1                        1457
#define TRISB2                        1458
#define TRISB3                        1459
#define TRISB4                        1460
#define TRISB5                        1461
#define TRISB6                        1462
#define TRISB7                        1463
#define TRISC                         1464
#define TRISC0                        1465
#define TRISC1                        1466
#define TRISC2                        1467
#define TRISC3                        1468
#define TRISC4                        1469
#define TRISC5                        1470
#define TRISC6                        1471
#define TRISC7                        1472
#define TRISD                         1473
#define TRISD0                        1474
#define TRISD1                        1475
#define TRISD2                        1476
#define TRISD3                        1477
#define TRISD4                        1478
#define TRISD5                        1479
#define TRISD6                        1480
#define TRISD7                        1481
#define TRISE                         1482
#define TRISE0                        1483
#define TRISE1                        1484
#define TRISE2                        1485
#define TRISE3                        1486
#define TRISE4                        1487
#define TRISE5                        1488
#define TRISE6                        1489
#define TRISE7                        1490
#define TRISF                         1491
#define TRISF1                        1492
#define TRISF2                        1493
#define TRISF3                        1494
#define TRISF4                        1495
#define TRISF5                        1496
#define TRISF6                        1497
#define TRISF7                        1498
#define TRISG                         1499
#define TRISG0                        1500
#define TRISG1                        1501
#define TRISG2                        1502
#define TRISG3                        1503
#define TRISG4                        1504
#define OSCTUNE                       1505
#define TUN0                          1506
#define TUN                           1507
#define TUN1                          1508
#define TUN2                          1509
#define TUN3                          1510
#define TUN4                          1511
#define TUN5                          1512
#define PLLEN                         1513
#define INTSRC                        1514
#define PSTR1CON                      1515
#define PSTR1CON_STRA                 1516
#define PSTR1CON_STRB                 1517
#define PSTR1CON_STRC                 1518
#define PSTR1CON_STRD                 1519
#define PSTR1CON_STRSYNC              1520
#define PSTR1CON_CMPL0                1521
#define PSTR1CON_CMPL                 1522
#define PSTR1CON_CMPL1                1523
#define PIE1                          1524
#define TMR1IE                        1525
#define TMR2IE                        1526
#define TMR1GIE                       1527
#define SSP1IE                        1528
#define SSPIE                         1529
#define TXIE                          1530
#define TX1IE                         1531
#define RCIE                          1532
#define RC1IE                         1533
#define ADIE                          1534
#define PIR1                          1535
#define TMR1IF                        1536
#define TMR2IF                        1537
#define TMR1GIF                       1538
#define SSPIF                         1539
#define SSP1IF                        1540
#define TXIF                          1541
#define TX1IF                         1542
#define RCIF                          1543
#define RC1IF                         1544
#define ADIF                          1545
#define IPR1                          1546
#define TMR1IP                        1547
#define TMR2IP                        1548
#define TMR1GIP                       1549
#define SSPIP                         1550
#define SSP1IP                        1551
#define TX1IP                         1552
#define TXIP                          1553
#define RCIP                          1554
#define RC1IP                         1555
#define ADIP                          1556
#define PIE2                          1557
#define TMR3GIE                       1558
#define TMR3IE                        1559
#define HLVDIE                        1560
#define LVDIE                         1561
#define BCL1IE                        1562
#define BCLIE                         1563
#define BCL2IE                        1564
#define SSP2IE                        1565
#define OSCFIE                        1566
#define PIR2                          1567
#define TMR3GIF                       1568
#define TMR3IF                        1569
#define HLVDIF                        1570
#define LVDIF                         1571
#define BCLIF                         1572
#define BCL1IF                        1573
#define BCL2IF                        1574
#define SSP2IF                        1575
#define OSCFIF                        1576
#define IPR2                          1577
#define TMR3GIP                       1578
#define TMR3IP                        1579
#define HLVDIP                        1580
#define LVDIP                         1581
#define BCLIP                         1582
#define BCL1IP                        1583
#define BCL2IP                        1584
#define SSP2IP                        1585
#define OSCFIP                        1586
#define PIE3                          1587
#define RXB0IE                        1588
#define RTCCIE                        1589
#define RXBNIE                        1590
#define CCP1IE                        1591
#define RXB1IE                        1592
#define CCP2IE                        1593
#define TXB0IE                        1594
#define CTMUIE                        1595
#define TXB1IE                        1596
#define TXBNIE                        1597
#define TXB2IE                        1598
#define TX2IE                         1599
#define RC2IE                         1600
#define LCDIE                         1601
#define TMR5GIE                       1602
#define PIR3                          1603
#define RTCCIF                        1604
#define RXBNIF                        1605
#define CCP1IF                        1606
#define CCP2IF                        1607
#define CTMUIF                        1608
#define TXBNIF                        1609
#define TX2IF                         1610
#define RC2IF                         1611
#define LCDIF                         1612
#define TMR5GIF                       1613
#define IPR3                          1614
#define RTCCIP                        1615
#define CCP1IP                        1616
#define RXBNIP                        1617
#define CCP2IP                        1618
#define CTMUIP                        1619
#define TX2IP                         1620
#define TXBNIP                        1621
#define RC2IP                         1622
#define LCDIP                         1623
#define TMR5GIP                       1624
#define PIR6                          1625
#define CMP1IF                        1626
#define CMP2IF                        1627
#define CMP3IF                        1628
#define EEIF                          1629
#define HLVDCON                       1630
#define HLVDL                         1631
#define HLVDL0                        1632
#define HLVDL1                        1633
#define HLVDL2                        1634
#define HLVDL3                        1635
#define HLVDEN                        1636
#define IRVST                         1637
#define BGVST                         1638
#define VDIRMAG                       1639
#define IPR6                          1640
#define CMP1IP                        1641
#define CMP2IP                        1642
#define CMP3IP                        1643
#define EEIP                          1644
#define T1GCON                        1645
#define T1GSS0                        1646
#define T1GSS                         1647
#define T1GSS1                        1648
